fun main() {
    println("Введите четырехзначное число")
    val a = readln().toDouble()

    println("Введите число для определения кратности")
    val a1 = readln().toDouble()

    if(((a % 10)+((((a % 100) - (a % 10))/10))) == ((((a % 1000)- a % 100)/100) + ((a % 10000)- a % 1000)/1000)){
    println("Сумма двух первых и последних чисел одинакова :${(((a % 10)+((((a % 100) - (a % 10))/10))))} = ${((((a % 1000)- a % 100)/100) + ((a % 10000)- a % 1000)/1000)}")
    }
    if(((((((a % 10)+((((a % 100) - (a % 10))/10))) + ((((a % 1000)- a % 100)/100) + ((a % 10000)- a % 1000)/1000)))) % 3) == 0.0){
        println("Сумма чисел = ${((((a % 10)+((((a % 100) - (a % 10))/10))) + ((((a % 1000)- a % 100)/100) + ((a % 10000)- a % 1000)/1000)).toInt())} кратна 3")
    }
    if(((((((a % 10)*((((a % 100) - (a % 10))/10))) * ((((a % 1000)- a % 100)/100) * ((a % 10000)- a % 1000)/1000)))) % 4) == 0.0){
        println("Произведение чисел = ${((((a % 10)*((((a % 100) - (a % 10))/10))) * ((((a % 1000)- a % 100)/100) * ((a % 10000)- a % 1000)/1000)).toInt())}, кратно 4")
    }
    if(((((((a % 10)*((((a % 100) - (a % 10))/10))) * ((((a % 1000)- a % 100)/100) * ((a % 10000)- a % 1000)/1000)))) % a1) == 0.0){
        println("Произведение чисел = ${((((a % 10)*((((a % 100) - (a % 10))/10))) * ((((a % 1000)- a % 100)/100) * ((a % 10000)- a % 1000)/1000)).toInt())} кратно ${a1.toInt()}")
    }
}

